bad
worst
great
waste
awful
excellent
terrible
worse
waste_time
nothing
wonderful
stupid
no
best
boring
horrible
so_bad
even
minutes
poor
crap
love
just
supposed
poorly
perfect
script
acting
loved
why
supposed_to
ridiculous
beautiful
at_all
wasted
avoid
plot
any
amazing
favorite
well
lame
annoying
brilliant
not_even
superb
worst_movie
don't
pointless
oh
life
dull
must_see
thing
supposed_to_be
mess
laughable
highly
badly
pathetic
cheap
bad_acting
money
least
bad_movie
unless
if
fantastic
beautifully
instead
could
very
reason
couldn't
also
performance
really_bad
both
make
don't_waste
very_well
garbage
at_least
2
highly_recommend
performances
always
unfortunately
sorry
so
do
fails
enjoyed
how_bad
worst_movies
10_10
only
save
1
highly_recommended
anything
redeeming
or
well_worth
worse_than
no_sense
wonderfully
like
then
years
predictable
perfectly
decent
strong
better
world
not_funny
didn't
outstanding
i'm
8_10
3_10
7_10
to_make
would
off
whatsoever
ok
low
don't_waste_time
even_worse
there
excuse
3
4_10
8
bother
worst_film
today
nothing_to
powerful
not_worth
definitely
looks_like
to_be
idea
sit_through
guess
4
touching
dumb
half
as_well
actually
mean
bad_as
unfunny
well_as
wooden
look_like
7
own
true
worst_movie_ever
only_reason
as_well_as
young
absolutely_no
joke
attempt
weak
masterpiece
don't_even
terrific
amateurish
sucks
as_bad
recommended
looks
guy
only_good
bad_that
heart
disappointment
bad_but
brilliantly
1_10
wasn't
supporting
gives
especially
at_all_costs
budget
still
to_sit_through
okay
all_costs
so_bad_that
hour
apparently
performance_as
9_10
attempt_at
stunning
family
great_movie
rubbish
enjoyable
job
ever_seen
greatest
very_good
on_dvd
may_not
it's_just
problem
dreadful
insult
none
not_good
great_film
as_bad_as
subtle
incredible
great_job
disappointing
or_something
that_bad
looked
flat
atrocious
worst_films
very_bad
mediocre
captures
trying
each
be_worst
1_out
embarrassing
realistic
wasting
only_thing
effects
if_want
role
should
make_movie
bunch
movie_just
either
gem
painful
definitely_worth
wrong
completely
works
just_plain
watching
different
shows
acting_bad
lives
someone
delightful
human
well_done
fascinating
classic
something
remotely
money_on
why_did
trash
that's
piece_crap
memorable
total
will
war
lousy
underrated
bad_movies
silly
waste_money
avoid_at
tedious
bored
fun
awesome
nowhere
series
refreshing
there_no
1_out_10
hilarious
perfection
with_great
bad_film
unique
bad_it's
uninteresting
time_money
worst_movies_ever
avoid_at_all
can't
pretty_bad
story
low_budget
utter
seriously
be_funny
there_nothing
crappy
as_if
if_want_to
shallow
no_reason
pile
unconvincing
in_movie
sweet
could_been
to_do_with
4_out_10
forgettable
bland
there's
fake
well_written
first_saw
journey
solid
friendship
moving
to_make_movie
failed
let's
extraordinary
poorly_written
would_been
incoherent
just_bad
unbelievable
finest
costs
favourite
3_out_10
recommend
complex
first_time
uninspired
avoid_at_all_costs
except
loved_movie
only_good_thing
random
trying_to
stinker
tried
rip_off
but_also
point
idiotic
movie_so_bad
insult_to
drivel
barely
absolutely_nothing
pretty
doesn't_even
emotions
get
maybe
hoping
0
movie_ever
it's_not_even
else
complete_waste
to_do
isn't_even
awful_movie
3_out
no_plot
terrible_movie
isn't
excellent_as
oscar
made
special_effects
enough
2_10
tries
rent
simple
doesn't
i'm_sorry
just_not
rare
no_real
at_same
do_with
many
whole
fine
unforgettable
in_love
so_well
looked_like
breathtaking
just_awful
at_same_time
can't_believe
zero
to_waste
magnificent
plain
horrid
stupidity
supposedly
write
obviously
any_characters
intense
7_out_10
miserably
not_recommend
please
beauty
gorgeous
some_kind
premise
relationship
stay_away
holes
90_minutes
hell
irritating
experience
top_notch
acting_horrible
obvious
romantic
drama
mst3k
7_out
existent
don't_bother
2_out_10
same_time
dvd
killed
cliché
non_existent
to_sit
flawless
horribly
freedom
unwatchable
what_waste
much_better
flick
worst_movie_ever_seen
painfully
poignant
enjoy
4_out
great_as
movie_bad
doesn't_work
come_on
fails_to
movie_terrible
favorites
excellent_film
some
mildly
some_sort
boredom
thing_about
minutes_life
to_see_again
asleep
lacks
love_movie
bad_script
5_minutes
but_just
pleasantly_surprised
all_ages
had
sat_through
so_bad_it's
god
music
tripe
dialogue
that_would
nothing_more
abysmal
see_again
not_waste
wasting_time
looking
clichéd
ludicrous
been
john
tale
wouldn't
plays
superbly
be_good
personal
embarrassed
walked_out
2_out
appalling
blame
waste_time_money
man
effort
paid
seemed
camera
hours_life
junk
movie_so
sequel
god_awful
to_be_worst
9
lack
sat
piece_garbage
fast_forward
didn't_even
do_not
some_worst
unexpected
may
makes_no_sense
to_be_funny
10_minutes
with_no
spent
thing_that
would_be
they're
unusual
complete_waste_time
worst_movie_i've
ages
that's_about
makes
pleasantly
seconds
what_hell
remarkable
unlike
monster
8_out
truly_awful
even_remotely
in_love_with
way_too
b
be_missed
inept
whole_movie
nothing_to_do
helps
acting_terrible
best_movies
8_out_10
love_with
poor_acting
only_redeeming
nothing_more_than
notch
what_point
30_minutes
about_as
might
terrible_acting
score_by
it's_great
avoid_movie
unoriginal
genius
very_different
far_worst
if_had
couldn't_even
even_that
worst_film_ever
dreck
only_thing_that
in_role
probably_worst
on_on
suck
timeless
at_time
did
portrayal
care_about
tragic
pretentious
charming
funniest
good_idea
feelings
between
insulting
care
marvelous
honestly
father
horrible_acting
played
thinking
want
edge_seat
delivers
first_rate
some_best
even_get
there_absolutely
complete
there's_no
believable
by_far_worst
laughably
whole_thing
i've_ever
rip
worst_thing
tries_to_be
may_not_be
good_thing
impressed
yeah
waste_time_on
useless
writing
treat
attempt_to
weren't
even_worth
good_as
bad_acting_bad
warm
does_great
good_thing_about
winning
brings
writers
appreciate
delight
city
can't_wait
downhill
do_not_watch
money_back
natural
as_good
others
movie_great
don't_miss
gripping
edge
not_that
liked
score
later
believe
quite
very_well_done
gore
got
bad_enough
supporting_cast
so_stupid
straight_to
turkey
possibly_worst
also_great
unintentionally
total_waste
rented
saying
society
horrendous
like_plague
joy
renting
scary
minutes_into
going
painful_to
worst_i've
very_entertaining
terrible_film
i'm_not
emotional
wonderful_film
nicely
awful_film
bad_bad
very_poor
dire
grade
save_money
brought
disaster
ugly
i've_ever_seen
nonsense
provides
really_enjoyed
i'll
thin
avoid_like
as_worst
to_all
bottom
childhood
late
any_sense
in_first_place
best_film
perfect_as
live
important
debut
most
best_films
entire_movie
effective
in_own
keeps
because
atmosphere
inexplicably
not_scary
cgi
fabulous
sometimes
first_place
joy_to
do_not_waste
steals_show
wasted_time
sub_par
noir
perfectly_cast
even_close
unintentional
b_movie
not_enough
lovely
walked
acting_great
movie_worst
sadness
sorry_but
screaming
also_very
cover
future
episodes
doesn't_make
lackluster
plot_holes
most_annoying
just_terrible
today's
what_makes
exceptional
tells
cardboard
watchable
will_love
easy
on_edge_seat
come_up_with
why_would
want_to
with_bad
nothing_to_do_with
bad_in
acting_poor
endless
film_very
reason_to
happiness
great_acting
can't_even
